###################################################################

# Created by write_sdc on Sun Apr 12 13:09:07 2015

###################################################################
set sdc_version 1.9

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports ph1]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports ph2]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports reset]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports input_error]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports {row_write[1]}]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports {row_write[0]}]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports {col_write[1]}]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports {col_write[0]}]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports {xoro_write[1]}]
set_driving_cell -lib_cell inv_4x -library muddlib [get_ports {xoro_write[0]}]
set_load -pin_load 0.0349584 [get_ports {row_ai[1]}]
set_load -pin_load 0.0349584 [get_ports {row_ai[0]}]
set_load -pin_load 0.0349584 [get_ports {col_ai[1]}]
set_load -pin_load 0.0349584 [get_ports {col_ai[0]}]
set_load -pin_load 0.0349584 [get_ports {row_out[1]}]
set_load -pin_load 0.0349584 [get_ports {row_out[0]}]
set_load -pin_load 0.0349584 [get_ports {col_out[1]}]
set_load -pin_load 0.0349584 [get_ports {col_out[0]}]
set_load -pin_load 0.0349584 [get_ports {xoro_out[1]}]
set_load -pin_load 0.0349584 [get_ports {xoro_out[0]}]
set_load -pin_load 0.0349584 [get_ports {win[1]}]
set_load -pin_load 0.0349584 [get_ports {win[0]}]
set_load -pin_load 0.0349584 [get_ports write_error]
create_clock [get_ports ph1]  -period 10  -waveform {0 5}
set_input_delay -clock ph1  0.5  [get_ports ph1]
set_input_delay -clock ph1  0.5  [get_ports ph2]
set_input_delay -clock ph1  0.5  [get_ports reset]
set_input_delay -clock ph1  0.5  [get_ports input_error]
set_input_delay -clock ph1  0.5  [get_ports {row_write[1]}]
set_input_delay -clock ph1  0.5  [get_ports {row_write[0]}]
set_input_delay -clock ph1  0.5  [get_ports {col_write[1]}]
set_input_delay -clock ph1  0.5  [get_ports {col_write[0]}]
set_input_delay -clock ph1  0.5  [get_ports {xoro_write[1]}]
set_input_delay -clock ph1  0.5  [get_ports {xoro_write[0]}]
set_output_delay -clock ph1  0.5  [get_ports {row_ai[1]}]
set_output_delay -clock ph1  0.5  [get_ports {row_ai[0]}]
set_output_delay -clock ph1  0.5  [get_ports {col_ai[1]}]
set_output_delay -clock ph1  0.5  [get_ports {col_ai[0]}]
set_output_delay -clock ph1  0.5  [get_ports {row_out[1]}]
set_output_delay -clock ph1  0.5  [get_ports {row_out[0]}]
set_output_delay -clock ph1  0.5  [get_ports {col_out[1]}]
set_output_delay -clock ph1  0.5  [get_ports {col_out[0]}]
set_output_delay -clock ph1  0.5  [get_ports {xoro_out[1]}]
set_output_delay -clock ph1  0.5  [get_ports {xoro_out[0]}]
set_output_delay -clock ph1  0.5  [get_ports {win[1]}]
set_output_delay -clock ph1  0.5  [get_ports {win[0]}]
set_output_delay -clock ph1  0.5  [get_ports write_error]
